{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"name": "lstm_1", "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "sigmoid", "go_backwards": false, "bias_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "return_sequences": true, "dropout": 0.0, "units": 10, "trainable": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "implementation": 2, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "batch_input_shape": [null, 5, 1], "use_bias": true, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 2, "recurrent_dropout": 0.0, "go_backwards": false, "bias_constraint": null, "recurrent_activation": "sigmoid", "unroll": false, "return_sequences": true, "dropout": 0.0, "units": 10, "trainable": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "dtype": "float32", "use_bias": true, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 2, "recurrent_dropout": 0.0, "go_backwards": false, "bias_constraint": null, "recurrent_activation": "sigmoid", "unroll": false, "return_sequences": true, "dropout": 0.0, "units": 10, "trainable": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "dtype": "float32", "use_bias": true, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"name": "lstm_4", "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 2, "recurrent_dropout": 0.0, "go_backwards": false, "bias_constraint": null, "recurrent_activation": "sigmoid", "unroll": false, "return_sequences": false, "dropout": 0.0, "units": 10, "trainable": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "dtype": "float32", "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "use_bias": true}}]}}