{"config": {"layers": [{"config": {"units": 10, "batch_input_shape": [null, 5, 1], "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "activation": "tanh", "return_sequences": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "trainable": true, "dropout": 0.0, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "implementation": 2, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_1", "unroll": false}, "class_name": "LSTM"}, {"config": {"units": 10, "return_state": false, "bias_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "return_sequences": true, "activity_regularizer": null, "name": "lstm_2", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "trainable": true, "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "implementation": 2, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false}, "class_name": "LSTM"}, {"config": {"units": 10, "return_state": false, "bias_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "return_sequences": true, "activity_regularizer": null, "name": "lstm_3", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "trainable": true, "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "implementation": 2, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false}, "class_name": "LSTM"}, {"config": {"units": 10, "return_state": false, "bias_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "return_sequences": false, "activity_regularizer": null, "name": "lstm_4", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "trainable": true, "dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "implementation": 2, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false}, "class_name": "LSTM"}, {"config": {"units": 1, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense_1", "use_bias": true, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.3.1", "class_name": "Sequential", "backend": "tensorflow"}