{"keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"config": {"recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "implementation": 2, "kernel_constraint": null, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 5, 1], "units": 10, "unroll": false, "unit_forget_bias": true, "stateful": false, "go_backwards": false, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_constraint": null, "recurrent_activation": "sigmoid", "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "bias_regularizer": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "implementation": 2, "kernel_constraint": null, "trainable": true, "dtype": "float32", "unroll": false, "units": 10, "unit_forget_bias": true, "stateful": false, "go_backwards": false, "name": "lstm_2", "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_constraint": null, "recurrent_activation": "sigmoid", "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "bias_regularizer": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "implementation": 2, "kernel_constraint": null, "trainable": true, "dtype": "float32", "unroll": false, "units": 10, "unit_forget_bias": true, "stateful": false, "go_backwards": false, "name": "lstm_3", "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_constraint": null, "recurrent_activation": "sigmoid", "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "bias_regularizer": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "implementation": 2, "kernel_constraint": null, "trainable": true, "dtype": "float32", "unroll": false, "units": 10, "unit_forget_bias": true, "stateful": false, "go_backwards": false, "name": "lstm_4", "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_constraint": null, "recurrent_activation": "sigmoid", "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": false, "bias_regularizer": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"use_bias": true, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "units": 1, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}