{"keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"config": {"recurrent_activation": "sigmoid", "trainable": true, "return_sequences": true, "return_state": false, "unroll": false, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "name": "lstm_1", "units": 10, "bias_regularizer": null, "implementation": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activation": "tanh", "dtype": "float32", "batch_input_shape": [null, 5, 1], "bias_constraint": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "stateful": false, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "sigmoid", "activity_regularizer": null, "name": "lstm_2", "return_sequences": true, "return_state": false, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "units": 10, "bias_regularizer": null, "implementation": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "dropout": 0.0, "activation": "tanh", "dtype": "float32", "bias_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "stateful": false, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "sigmoid", "activity_regularizer": null, "name": "lstm_3", "return_sequences": true, "return_state": false, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "units": 10, "bias_regularizer": null, "implementation": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "dropout": 0.0, "activation": "tanh", "dtype": "float32", "bias_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "stateful": false, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "sigmoid", "activity_regularizer": null, "name": "lstm_4", "return_sequences": false, "return_state": false, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "units": 10, "bias_regularizer": null, "implementation": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "dropout": 0.0, "activation": "tanh", "dtype": "float32", "bias_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "stateful": false, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "units": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}