{"keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"config": {"trainable": true, "unroll": false, "unit_forget_bias": true, "recurrent_activation": "sigmoid", "name": "lstm_1", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "batch_input_shape": [null, 5, 1], "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "use_bias": true, "dropout": 0.0, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "kernel_regularizer": null, "implementation": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "bias_regularizer": null, "activation": "tanh", "return_sequences": true}, "class_name": "LSTM"}, {"config": {"trainable": true, "unroll": false, "unit_forget_bias": true, "recurrent_activation": "sigmoid", "name": "lstm_2", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "return_sequences": true, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "use_bias": true, "dropout": 0.0, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "kernel_regularizer": null, "implementation": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "bias_regularizer": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"trainable": true, "unroll": false, "unit_forget_bias": true, "recurrent_activation": "sigmoid", "name": "lstm_3", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "return_sequences": true, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "use_bias": true, "dropout": 0.0, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "kernel_regularizer": null, "implementation": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "bias_regularizer": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"trainable": true, "unroll": false, "unit_forget_bias": true, "recurrent_activation": "sigmoid", "name": "lstm_4", "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "return_sequences": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "use_bias": true, "dropout": 0.0, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "kernel_regularizer": null, "implementation": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "bias_regularizer": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}