{"backend": "tensorflow", "keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"config": {"units": 10, "use_bias": true, "activation": "tanh", "unroll": false, "return_sequences": true, "recurrent_regularizer": null, "implementation": 2, "dtype": "float32", "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "bias_regularizer": null, "stateful": false, "go_backwards": false, "batch_input_shape": [null, 5, 1], "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "recurrent_dropout": 0.0, "name": "lstm_1", "recurrent_activation": "sigmoid", "return_state": false}, "class_name": "LSTM"}, {"config": {"units": 10, "use_bias": true, "activation": "tanh", "unroll": false, "return_sequences": true, "recurrent_regularizer": null, "implementation": 2, "dtype": "float32", "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "bias_regularizer": null, "stateful": false, "go_backwards": false, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "recurrent_dropout": 0.0, "name": "lstm_2", "recurrent_activation": "sigmoid", "return_state": false}, "class_name": "LSTM"}, {"config": {"units": 10, "use_bias": true, "activation": "tanh", "unroll": false, "return_sequences": true, "recurrent_regularizer": null, "implementation": 2, "dtype": "float32", "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "bias_regularizer": null, "stateful": false, "go_backwards": false, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "recurrent_dropout": 0.0, "name": "lstm_3", "recurrent_activation": "sigmoid", "return_state": false}, "class_name": "LSTM"}, {"config": {"units": 10, "use_bias": true, "activation": "tanh", "unroll": false, "return_sequences": false, "recurrent_regularizer": null, "implementation": 2, "dtype": "float32", "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "bias_regularizer": null, "stateful": false, "go_backwards": false, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "recurrent_dropout": 0.0, "name": "lstm_4", "recurrent_activation": "sigmoid", "return_state": false}, "class_name": "LSTM"}, {"config": {"units": 1, "use_bias": true, "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}]}, "class_name": "Sequential"}