{"keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"config": {"stateful": false, "unit_forget_bias": true, "use_bias": true, "trainable": true, "go_backwards": false, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 2, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "units": 10, "name": "lstm_1", "recurrent_constraint": null, "recurrent_regularizer": null, "activation": "tanh", "recurrent_activation": "sigmoid", "batch_input_shape": [null, 5, 1], "bias_regularizer": null, "unroll": false, "dropout": 0.0, "activity_regularizer": null, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"stateful": false, "unit_forget_bias": true, "use_bias": true, "trainable": true, "go_backwards": false, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 2, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "units": 10, "name": "lstm_2", "recurrent_constraint": null, "unroll": false, "activation": "tanh", "recurrent_activation": "sigmoid", "bias_regularizer": null, "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"stateful": false, "unit_forget_bias": true, "use_bias": true, "trainable": true, "go_backwards": false, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 2, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "units": 10, "name": "lstm_3", "recurrent_constraint": null, "unroll": false, "activation": "tanh", "recurrent_activation": "sigmoid", "bias_regularizer": null, "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"stateful": false, "unit_forget_bias": true, "use_bias": true, "trainable": true, "go_backwards": false, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 2, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "units": 10, "name": "lstm_4", "recurrent_constraint": null, "unroll": false, "activation": "tanh", "recurrent_activation": "sigmoid", "bias_regularizer": null, "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "return_sequences": false}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "bias_constraint": null, "units": 1, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}