{"config": {"layers": [{"config": {"return_sequences": true, "unroll": false, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "return_state": false, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "trainable": true, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_constraint": null, "activity_regularizer": null, "name": "lstm_1", "batch_input_shape": [null, 5, 1], "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "units": 10, "unit_forget_bias": true, "dropout": 0.0, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 2}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "unroll": false, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "return_state": false, "dtype": "float32", "bias_regularizer": null, "trainable": true, "stateful": false, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 10, "activity_regularizer": null, "name": "lstm_2", "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 2}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "unroll": false, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "return_state": false, "dtype": "float32", "bias_regularizer": null, "trainable": true, "stateful": false, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 10, "activity_regularizer": null, "name": "lstm_3", "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 2}, "class_name": "LSTM"}, {"config": {"return_sequences": false, "unroll": false, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "return_state": false, "dtype": "float32", "bias_regularizer": null, "trainable": true, "stateful": false, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 10, "activity_regularizer": null, "name": "lstm_4", "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 2}, "class_name": "LSTM"}, {"config": {"activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.3.1"}