{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_sequences": true, "batch_input_shape": [null, 5, 1], "stateful": false, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "return_state": false, "dtype": "float32", "use_bias": true, "activity_regularizer": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "lstm_1", "activation": "tanh", "trainable": true, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "units": 10, "unroll": false, "recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_sequences": true, "stateful": false, "recurrent_constraint": null, "use_bias": true, "return_state": false, "dtype": "float32", "recurrent_activation": "sigmoid", "activity_regularizer": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "lstm_2", "activation": "tanh", "trainable": true, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "units": 10, "unroll": false, "recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_sequences": true, "stateful": false, "recurrent_constraint": null, "use_bias": true, "return_state": false, "dtype": "float32", "recurrent_activation": "sigmoid", "activity_regularizer": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "lstm_3", "activation": "tanh", "trainable": true, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "units": 10, "unroll": false, "recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_sequences": false, "stateful": false, "recurrent_constraint": null, "use_bias": true, "return_state": false, "dtype": "float32", "recurrent_activation": "sigmoid", "activity_regularizer": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "lstm_4", "activation": "tanh", "trainable": true, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "units": 10, "unroll": false, "recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "units": 1, "use_bias": true, "name": "dense_1", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear"}}]}}