{"backend": "tensorflow", "keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"config": {"name": "lstm_1", "recurrent_constraint": null, "return_state": false, "unroll": false, "batch_input_shape": [null, 5, 1], "return_sequences": true, "stateful": false, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "implementation": 2, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "tanh", "dtype": "float32", "trainable": true, "units": 10}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "recurrent_constraint": null, "return_state": false, "unroll": false, "return_sequences": true, "stateful": false, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "use_bias": true, "implementation": 2, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "tanh", "kernel_constraint": null, "dtype": "float32", "trainable": true, "units": 10}, "class_name": "LSTM"}, {"config": {"name": "lstm_3", "recurrent_constraint": null, "return_state": false, "unroll": false, "return_sequences": true, "stateful": false, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "use_bias": true, "implementation": 2, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "tanh", "kernel_constraint": null, "dtype": "float32", "trainable": true, "units": 10}, "class_name": "LSTM"}, {"config": {"name": "lstm_4", "recurrent_constraint": null, "return_state": false, "unroll": false, "return_sequences": false, "stateful": false, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "use_bias": true, "implementation": 2, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "tanh", "kernel_constraint": null, "dtype": "float32", "trainable": true, "units": 10}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "dtype": "float32", "trainable": true, "kernel_constraint": null, "use_bias": true, "units": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}