{"config": {"layers": [{"config": {"dropout": 0.0, "dtype": "float32", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "batch_input_shape": [null, 5, 1], "trainable": true, "units": 10, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_1", "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 2, "recurrent_activation": "sigmoid", "go_backwards": false, "stateful": false, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "unit_forget_bias": true, "return_state": false}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "dtype": "float32", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "trainable": true, "units": 10, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_2", "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 2, "recurrent_activation": "sigmoid", "go_backwards": false, "stateful": false, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "unit_forget_bias": true, "return_state": false}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "dtype": "float32", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "trainable": true, "units": 10, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_3", "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 2, "recurrent_activation": "sigmoid", "go_backwards": false, "stateful": false, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "unit_forget_bias": true, "return_state": false}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "dtype": "float32", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "trainable": true, "units": 10, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_4", "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "implementation": 2, "recurrent_activation": "sigmoid", "go_backwards": false, "stateful": false, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "unit_forget_bias": true, "return_state": false}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "units": 1, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Sequential"}