{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_constraint": null, "use_bias": true, "dtype": "float32", "unroll": false, "dropout": 0.0, "units": 10, "trainable": true, "batch_input_shape": [null, 5, 1], "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "go_backwards": false, "unit_forget_bias": true, "kernel_constraint": null, "activation": "tanh", "stateful": false, "name": "lstm_1", "recurrent_activation": "sigmoid", "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": true, "implementation": 2}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dtype": "float32", "unroll": false, "dropout": 0.0, "units": 10, "trainable": true, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "go_backwards": false, "unit_forget_bias": true, "kernel_constraint": null, "activation": "tanh", "stateful": false, "name": "lstm_2", "recurrent_activation": "sigmoid", "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": true, "implementation": 2}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dtype": "float32", "unroll": false, "dropout": 0.0, "units": 10, "trainable": true, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "go_backwards": false, "unit_forget_bias": true, "kernel_constraint": null, "activation": "tanh", "stateful": false, "name": "lstm_3", "recurrent_activation": "sigmoid", "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": true, "implementation": 2}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dtype": "float32", "unroll": false, "dropout": 0.0, "units": 10, "trainable": true, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "go_backwards": false, "unit_forget_bias": true, "kernel_constraint": null, "activation": "tanh", "stateful": false, "name": "lstm_4", "recurrent_activation": "sigmoid", "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": false, "implementation": 2}}, {"class_name": "Dense", "config": {"activation": "linear", "use_bias": true, "units": 1, "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null}}]}, "backend": "tensorflow", "keras_version": "2.3.1"}