{"backend": "tensorflow", "keras_version": "2.3.1", "class_name": "Sequential", "config": {"layers": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "name": "lstm_1", "return_sequences": true, "batch_input_shape": [null, 5, 1], "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "units": 10, "unit_forget_bias": true, "use_bias": true, "activation": "tanh", "stateful": false, "implementation": 2, "go_backwards": false, "recurrent_activation": "sigmoid", "bias_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "name": "lstm_2", "return_sequences": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "units": 10, "unit_forget_bias": true, "use_bias": true, "activation": "tanh", "stateful": false, "implementation": 2, "go_backwards": false, "recurrent_activation": "sigmoid", "bias_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "name": "lstm_3", "return_sequences": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "units": 10, "unit_forget_bias": true, "use_bias": true, "activation": "tanh", "stateful": false, "implementation": 2, "go_backwards": false, "recurrent_activation": "sigmoid", "bias_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "name": "lstm_4", "return_sequences": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "units": 10, "unit_forget_bias": true, "use_bias": true, "activation": "tanh", "stateful": false, "implementation": 2, "go_backwards": false, "recurrent_activation": "sigmoid", "bias_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "units": 1, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "trainable": true}}], "name": "sequential_1"}}