{"config": {"name": "sequential_1", "layers": [{"config": {"bias_regularizer": null, "units": 10, "stateful": false, "trainable": true, "go_backwards": false, "unroll": false, "name": "lstm_1", "recurrent_activation": "sigmoid", "bias_constraint": null, "return_sequences": true, "implementation": 2, "recurrent_regularizer": null, "return_state": false, "activation": "tanh", "recurrent_constraint": null, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "batch_input_shape": [null, 5, 1], "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "units": 10, "stateful": false, "trainable": true, "go_backwards": false, "unroll": false, "name": "lstm_2", "recurrent_activation": "sigmoid", "bias_constraint": null, "return_sequences": true, "implementation": 2, "recurrent_regularizer": null, "return_state": false, "activation": "tanh", "recurrent_constraint": null, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "units": 10, "stateful": false, "trainable": true, "go_backwards": false, "unroll": false, "name": "lstm_3", "recurrent_activation": "sigmoid", "bias_constraint": null, "return_sequences": true, "implementation": 2, "recurrent_regularizer": null, "return_state": false, "activation": "tanh", "recurrent_constraint": null, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "units": 10, "stateful": false, "trainable": true, "go_backwards": false, "unroll": false, "name": "lstm_4", "recurrent_activation": "sigmoid", "bias_constraint": null, "return_sequences": false, "implementation": 2, "recurrent_regularizer": null, "return_state": false, "activation": "tanh", "recurrent_constraint": null, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "units": 1, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.3.1", "class_name": "Sequential"}