{"config": {"layers": [{"config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_1", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "sigmoid", "activity_regularizer": null, "dtype": "float32", "unroll": false, "activation": "tanh", "stateful": false, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "batch_input_shape": [null, 5, 1], "return_sequences": true, "units": 10, "implementation": 2, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_2", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "sigmoid", "activity_regularizer": null, "dtype": "float32", "unroll": false, "activation": "tanh", "stateful": false, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "return_sequences": true, "units": 10, "implementation": 2, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_3", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "sigmoid", "activity_regularizer": null, "dtype": "float32", "unroll": false, "activation": "tanh", "stateful": false, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "return_sequences": true, "units": 10, "implementation": 2, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_4", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "sigmoid", "activity_regularizer": null, "dtype": "float32", "unroll": false, "activation": "tanh", "stateful": false, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "return_sequences": false, "units": 10, "implementation": 2, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "activation": "linear", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.3.1", "class_name": "Sequential", "backend": "tensorflow"}