{"config": {"name": "sequential_1", "layers": [{"config": {"return_state": false, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 5, 1], "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "activation": "tanh", "name": "lstm_1", "recurrent_activation": "sigmoid", "unit_forget_bias": true, "units": 10, "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "dropout": 0.0, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 2, "recurrent_constraint": null, "trainable": true, "go_backwards": false, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"return_state": false, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "activation": "tanh", "name": "lstm_2", "recurrent_activation": "sigmoid", "unit_forget_bias": true, "units": 10, "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 2, "recurrent_constraint": null, "trainable": true, "go_backwards": false, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"return_state": false, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "activation": "tanh", "name": "lstm_3", "recurrent_activation": "sigmoid", "unit_forget_bias": true, "units": 10, "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 2, "recurrent_constraint": null, "trainable": true, "go_backwards": false, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"return_state": false, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "activation": "tanh", "name": "lstm_4", "recurrent_activation": "sigmoid", "unit_forget_bias": true, "units": 10, "bias_constraint": null, "return_sequences": false, "bias_regularizer": null, "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 2, "recurrent_constraint": null, "trainable": true, "go_backwards": false, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}]}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Sequential"}