{"class_name": "Sequential", "keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 5, 1], "unroll": false, "recurrent_dropout": 0.0, "return_state": false, "units": 10, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "lstm_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "activation": "tanh", "recurrent_activation": "sigmoid", "implementation": 2, "kernel_regularizer": null, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_dropout": 0.0, "return_state": false, "units": 10, "trainable": true, "recurrent_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "lstm_2", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "activation": "tanh", "recurrent_activation": "sigmoid", "implementation": 2, "kernel_regularizer": null, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_dropout": 0.0, "return_state": false, "units": 10, "trainable": true, "recurrent_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "lstm_3", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "stateful": false, "activation": "tanh", "recurrent_activation": "sigmoid", "implementation": 2, "kernel_regularizer": null, "unit_forget_bias": true}}, {"class_name": "LSTM", "config": {"unroll": false, "recurrent_dropout": 0.0, "return_state": false, "units": 10, "trainable": true, "recurrent_constraint": null, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "lstm_4", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "return_sequences": false, "stateful": false, "activation": "tanh", "recurrent_activation": "sigmoid", "implementation": 2, "kernel_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_1", "kernel_regularizer": null}}]}, "backend": "tensorflow"}