{"keras_version": "2.3.1", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"stateful": false, "kernel_constraint": null, "unit_forget_bias": true, "dtype": "float32", "batch_input_shape": [null, 5, 1], "return_sequences": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "go_backwards": false, "name": "lstm_1", "recurrent_activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "implementation": 2, "bias_regularizer": null, "activation": "tanh", "return_state": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "trainable": true, "bias_constraint": null, "dropout": 0.0, "use_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"stateful": false, "kernel_constraint": null, "unit_forget_bias": true, "dtype": "float32", "return_sequences": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "go_backwards": false, "name": "lstm_2", "recurrent_activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "implementation": 2, "bias_regularizer": null, "activation": "tanh", "return_state": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "trainable": true, "bias_constraint": null, "dropout": 0.0, "use_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"stateful": false, "kernel_constraint": null, "unit_forget_bias": true, "dtype": "float32", "return_sequences": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "go_backwards": false, "name": "lstm_3", "recurrent_activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "implementation": 2, "bias_regularizer": null, "activation": "tanh", "return_state": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "trainable": true, "bias_constraint": null, "dropout": 0.0, "use_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"stateful": false, "kernel_constraint": null, "unit_forget_bias": true, "dtype": "float32", "return_sequences": false, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "go_backwards": false, "name": "lstm_4", "recurrent_activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "implementation": 2, "bias_regularizer": null, "activation": "tanh", "return_state": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "trainable": true, "bias_constraint": null, "dropout": 0.0, "use_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 1, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true}}]}, "backend": "tensorflow"}