{"backend": "tensorflow", "keras_version": "2.3.1", "config": {"layers": [{"config": {"kernel_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "activity_regularizer": null, "batch_input_shape": [null, 5, 1], "name": "lstm_1", "unit_forget_bias": true, "return_state": false, "unroll": false, "implementation": 2, "kernel_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "go_backwards": false, "bias_constraint": null, "dtype": "float32", "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 10, "return_sequences": true, "use_bias": true, "recurrent_activation": "sigmoid", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "unroll": false, "unit_forget_bias": true, "return_state": false, "name": "lstm_2", "implementation": 2, "kernel_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "go_backwards": false, "bias_constraint": null, "dtype": "float32", "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 10, "return_sequences": true, "use_bias": true, "recurrent_activation": "sigmoid", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "unroll": false, "unit_forget_bias": true, "return_state": false, "name": "lstm_3", "implementation": 2, "kernel_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "go_backwards": false, "bias_constraint": null, "dtype": "float32", "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 10, "return_sequences": true, "use_bias": true, "recurrent_activation": "sigmoid", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "unroll": false, "unit_forget_bias": true, "return_state": false, "name": "lstm_4", "implementation": 2, "kernel_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "go_backwards": false, "bias_constraint": null, "dtype": "float32", "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 10, "return_sequences": false, "use_bias": true, "recurrent_activation": "sigmoid", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "activity_regularizer": null, "units": 1, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}