{"config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "unroll": false, "go_backwards": false, "trainable": true, "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_constraint": null, "name": "lstm_1", "units": 10, "stateful": false, "implementation": 2, "recurrent_activation": "sigmoid", "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_dropout": 0.0, "batch_input_shape": [null, 5, 1], "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "unroll": false, "go_backwards": false, "trainable": true, "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_constraint": null, "name": "lstm_2", "dropout": 0.0, "stateful": false, "implementation": 2, "recurrent_activation": "sigmoid", "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 10, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_dropout": 0.0, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "unroll": false, "go_backwards": false, "trainable": true, "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_constraint": null, "name": "lstm_3", "dropout": 0.0, "stateful": false, "implementation": 2, "recurrent_activation": "sigmoid", "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 10, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_dropout": 0.0, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "unroll": false, "go_backwards": false, "trainable": true, "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_constraint": null, "name": "lstm_4", "dropout": 0.0, "stateful": false, "implementation": 2, "recurrent_activation": "sigmoid", "activation": "tanh", "bias_regularizer": null, "return_sequences": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 10, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_dropout": 0.0, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "name": "dense_1", "activation": "linear", "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Sequential"}