{"keras_version": "2.3.1", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"unroll": false, "batch_input_shape": [null, 5, 1], "stateful": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "unit_forget_bias": true, "name": "lstm_1", "go_backwards": false, "return_sequences": true, "units": 10, "activation": "tanh", "kernel_constraint": null, "recurrent_activation": "sigmoid", "bias_regularizer": null, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "recurrent_constraint": null, "implementation": 2, "trainable": true, "recurrent_dropout": 0.0, "use_bias": true, "dropout": 0.0, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}}, {"class_name": "LSTM", "config": {"stateful": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "unit_forget_bias": true, "name": "lstm_2", "go_backwards": false, "bias_regularizer": null, "units": 10, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_activation": "sigmoid", "unroll": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "recurrent_constraint": null, "implementation": 2, "trainable": true, "recurrent_dropout": 0.0, "use_bias": true, "dropout": 0.0, "activity_regularizer": null, "return_sequences": true}}, {"class_name": "LSTM", "config": {"stateful": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "unit_forget_bias": true, "name": "lstm_3", "go_backwards": false, "bias_regularizer": null, "units": 10, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_activation": "sigmoid", "unroll": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "recurrent_constraint": null, "implementation": 2, "trainable": true, "recurrent_dropout": 0.0, "use_bias": true, "dropout": 0.0, "activity_regularizer": null, "return_sequences": true}}, {"class_name": "LSTM", "config": {"stateful": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "unit_forget_bias": true, "name": "lstm_4", "go_backwards": false, "bias_regularizer": null, "units": 10, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_activation": "sigmoid", "unroll": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "recurrent_constraint": null, "implementation": 2, "trainable": true, "recurrent_dropout": 0.0, "use_bias": true, "dropout": 0.0, "activity_regularizer": null, "return_sequences": false}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "units": 1, "trainable": true, "activation": "linear", "use_bias": true, "kernel_constraint": null}}]}, "backend": "tensorflow"}