{"config": {"name": "sequential_1", "layers": [{"config": {"bias_constraint": null, "return_state": false, "recurrent_constraint": null, "batch_input_shape": [null, 5, 1], "activity_regularizer": null, "implementation": 2, "use_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_activation": "sigmoid", "return_sequences": true, "name": "lstm_1", "dtype": "float32", "activation": "tanh", "bias_regularizer": null, "go_backwards": false, "unroll": false, "units": 10, "trainable": true, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "return_state": false, "recurrent_constraint": null, "activity_regularizer": null, "implementation": 2, "use_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_activation": "sigmoid", "return_sequences": true, "name": "lstm_2", "dtype": "float32", "activation": "tanh", "bias_regularizer": null, "go_backwards": false, "unroll": false, "units": 10, "trainable": true, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "return_state": false, "recurrent_constraint": null, "activity_regularizer": null, "implementation": 2, "use_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_activation": "sigmoid", "return_sequences": true, "name": "lstm_3", "dtype": "float32", "activation": "tanh", "bias_regularizer": null, "go_backwards": false, "unroll": false, "units": 10, "trainable": true, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "return_state": false, "recurrent_constraint": null, "activity_regularizer": null, "implementation": 2, "use_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_activation": "sigmoid", "return_sequences": false, "name": "lstm_4", "dtype": "float32", "activation": "tanh", "bias_regularizer": null, "go_backwards": false, "unroll": false, "units": 10, "trainable": true, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "units": 1, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.1"}