{"keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"recurrent_activation": "sigmoid", "recurrent_dropout": 0.0, "kernel_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "bias_regularizer": null, "name": "lstm_1", "kernel_regularizer": null, "implementation": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "stateful": false, "trainable": true, "return_sequences": true, "units": 10, "unroll": false, "batch_input_shape": [null, 5, 1], "recurrent_constraint": null, "dtype": "float32", "activation": "tanh", "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"recurrent_activation": "sigmoid", "recurrent_dropout": 0.0, "kernel_constraint": null, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "bias_regularizer": null, "name": "lstm_2", "kernel_regularizer": null, "implementation": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "stateful": false, "trainable": true, "return_sequences": true, "units": 10, "unit_forget_bias": true, "go_backwards": false, "recurrent_constraint": null, "dtype": "float32", "activation": "tanh", "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"recurrent_activation": "sigmoid", "recurrent_dropout": 0.0, "kernel_constraint": null, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "bias_regularizer": null, "name": "lstm_3", "kernel_regularizer": null, "implementation": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "stateful": false, "trainable": true, "return_sequences": true, "units": 10, "unit_forget_bias": true, "go_backwards": false, "recurrent_constraint": null, "dtype": "float32", "activation": "tanh", "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"recurrent_activation": "sigmoid", "recurrent_dropout": 0.0, "kernel_constraint": null, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "bias_regularizer": null, "name": "lstm_4", "kernel_regularizer": null, "implementation": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "stateful": false, "trainable": true, "return_sequences": false, "units": 10, "unit_forget_bias": true, "go_backwards": false, "recurrent_constraint": null, "dtype": "float32", "activation": "tanh", "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "linear"}}]}}