{"keras_version": "2.3.1", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "LSTM", "config": {"dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "batch_input_shape": [null, 5, 1], "kernel_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "return_state": false, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dtype": "float32", "trainable": true, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "return_sequences": true, "use_bias": true, "stateful": false, "implementation": 2, "recurrent_activation": "sigmoid", "unroll": false, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "stateful": false, "kernel_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "return_state": false, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dtype": "float32", "trainable": true, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "return_sequences": true, "use_bias": true, "implementation": 2, "recurrent_activation": "sigmoid", "unroll": false, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "stateful": false, "kernel_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_3", "return_state": false, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dtype": "float32", "trainable": true, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "return_sequences": true, "use_bias": true, "implementation": 2, "recurrent_activation": "sigmoid", "unroll": false, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "stateful": false, "kernel_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_4", "return_state": false, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dtype": "float32", "trainable": true, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "return_sequences": false, "use_bias": true, "implementation": 2, "recurrent_activation": "sigmoid", "unroll": false, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "dtype": "float32", "use_bias": true, "activity_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "kernel_regularizer": null}}], "name": "sequential_1"}}