{"config": {"name": "sequential_1", "layers": [{"config": {"return_sequences": true, "recurrent_activation": "sigmoid", "dropout": 0.0, "batch_input_shape": [null, 5, 1], "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "activation": "tanh", "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_state": false, "stateful": false, "kernel_regularizer": null, "units": 10, "go_backwards": false, "unroll": false, "implementation": 2}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "recurrent_activation": "sigmoid", "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "name": "lstm_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "activation": "tanh", "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_state": false, "stateful": false, "kernel_regularizer": null, "units": 10, "go_backwards": false, "unroll": false, "implementation": 2}, "class_name": "LSTM"}, {"config": {"return_sequences": true, "recurrent_activation": "sigmoid", "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "name": "lstm_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "activation": "tanh", "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_state": false, "stateful": false, "kernel_regularizer": null, "units": 10, "go_backwards": false, "unroll": false, "implementation": 2}, "class_name": "LSTM"}, {"config": {"return_sequences": false, "recurrent_activation": "sigmoid", "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "name": "lstm_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "activation": "tanh", "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_state": false, "stateful": false, "kernel_regularizer": null, "units": 10, "go_backwards": false, "unroll": false, "implementation": 2}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "use_bias": true}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.1"}