{"keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 5, 1], "unit_forget_bias": true, "bias_regularizer": null, "return_state": false, "dtype": "float32", "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 10, "bias_constraint": null, "stateful": false, "kernel_constraint": null, "return_sequences": true, "go_backwards": false, "unroll": false, "name": "lstm_1", "activity_regularizer": null, "recurrent_activation": "sigmoid", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "use_bias": true, "implementation": 2}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "bias_regularizer": null, "go_backwards": false, "dtype": "float32", "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 10, "bias_constraint": null, "kernel_constraint": null, "return_sequences": true, "return_state": false, "stateful": false, "name": "lstm_2", "activity_regularizer": null, "recurrent_activation": "sigmoid", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "trainable": true, "unroll": false, "implementation": 2}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "bias_regularizer": null, "go_backwards": false, "dtype": "float32", "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 10, "bias_constraint": null, "kernel_constraint": null, "return_sequences": true, "return_state": false, "stateful": false, "name": "lstm_3", "activity_regularizer": null, "recurrent_activation": "sigmoid", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "trainable": true, "unroll": false, "implementation": 2}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "bias_regularizer": null, "go_backwards": false, "dtype": "float32", "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 10, "bias_constraint": null, "kernel_constraint": null, "return_sequences": false, "return_state": false, "stateful": false, "name": "lstm_4", "activity_regularizer": null, "recurrent_activation": "sigmoid", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "trainable": true, "unroll": false, "implementation": 2}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 1, "bias_constraint": null, "use_bias": true, "trainable": true}}], "name": "sequential_1"}}