{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"return_sequences": true, "return_state": false, "name": "lstm_1", "recurrent_activation": "sigmoid", "units": 10, "go_backwards": false, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "stateful": false, "batch_input_shape": [null, 5, 1], "activation": "tanh", "dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "implementation": 2, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "return_state": false, "name": "lstm_2", "recurrent_activation": "sigmoid", "units": 10, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "stateful": false, "go_backwards": false, "activation": "tanh", "dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "implementation": 2, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "return_state": false, "name": "lstm_3", "recurrent_activation": "sigmoid", "units": 10, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "stateful": false, "go_backwards": false, "activation": "tanh", "dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "implementation": 2, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": false, "return_state": false, "name": "lstm_4", "recurrent_activation": "sigmoid", "units": 10, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "stateful": false, "go_backwards": false, "activation": "tanh", "dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "implementation": 2, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "use_bias": true, "bias_constraint": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "units": 1, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}