{"config": {"layers": [{"config": {"go_backwards": false, "recurrent_constraint": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "unroll": false, "return_sequences": true, "stateful": false, "implementation": 2, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 10, "unit_forget_bias": true, "bias_constraint": null, "batch_input_shape": [null, 5, 1], "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "dropout": 0.0, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_dropout": 0.0, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "recurrent_constraint": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "unroll": false, "return_sequences": true, "stateful": false, "implementation": 2, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 10, "unit_forget_bias": true, "bias_constraint": null, "name": "lstm_2", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "dropout": 0.0, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_dropout": 0.0, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "recurrent_constraint": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "unroll": false, "return_sequences": true, "stateful": false, "implementation": 2, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 10, "unit_forget_bias": true, "bias_constraint": null, "name": "lstm_3", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "dropout": 0.0, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_dropout": 0.0, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"go_backwards": false, "recurrent_constraint": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "unroll": false, "return_sequences": false, "stateful": false, "implementation": 2, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 10, "unit_forget_bias": true, "bias_constraint": null, "name": "lstm_4", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "dropout": 0.0, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_dropout": 0.0, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"units": 1, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.3.1", "class_name": "Sequential"}